---
kind: property
id: P:Autodesk.Revit.DB.SpacingRule.HasBeltMeasurement
source: html/2c0a2c77-c552-8e57-f8d1-092b25ea64cf.htm
---
# Autodesk.Revit.DB.SpacingRule.HasBeltMeasurement Property

True if the gridlines are not parallel due to surface
curvature, and the BeltMeasurement property therefore
applies.

## Syntax (C#)
```csharp
public bool HasBeltMeasurement { get; }
```